
//Разработайте алгоритм, который будет преобразовывать длинные URL в короткие.
// ---Убедитесь, что разные пользователи получают разные короткие ссылки на один и тот же URL.
// ---Реализуйте систему, которая будет отслеживать количество переходов по каждой ссылке.
//
// ---Как только лимит переходов будет исчерпан, пользователь должен быть уведомлен о недоступности ссылки, и её использование должно блокироваться.
// ---Ваша программа должна автоматически удалять ссылки, срок действия которых истек. Это может быть, например, через сутки после создания.
// ---Время жизни ссылки должно задаваться программно, а не пользователем.
// ---UUID пользователя генерируется при первом запросе на создание короткой ссылки и сохраняется для последующей работы с его ссылками.
// ---Все действия по редактированию или удалению ссылок доступны только создателю этой ссылки.
// * При вводе короткой ссылки в консоль пользователь должен автоматически перенаправляться на исходный ресурс в браузере:
//
//


import models.Link;
import models.User;
import services.LinkShorterService;
import services.MenuService;

import java.time.Duration;

public class Main {
    public static void main(String[] args) {

        MenuService app = new MenuService();
        app.handleMainMenu();

    }
}